# ชื่อรายการอาหารทั้งหมด
# ข้างใน list มี dictionary ทั้งหมด 100 ชิ้น โดยเลข index อยู่ที่ 0 ถึง 99
# ข้างใน dictionary ประกอบด้วย properties 3 อันคือ
# name: เก็บชื่ออาหาร
# price: เก็บราคา
# id: เก็บรหัสสินค้า
list_menu = [
    {
        "name": "ข้าวผัดกะเพราหมู",
        "price": 50,
        "id": 1776475
    },
    {
        "name": "ผัดไทยกุ้งสด",
        "price": 60,
        "id": 1444716
    },
    {
        "name": "ต้มยำกุ้ง",
        "price": 80,
        "id": 1601015
    },
    {
        "name": "ส้มตำ",
        "price": 40,
        "id": 3849731
    },
    {
        "name": "ปาตองโก",
        "price": 30,
        "id": 1324088
    },
    {
        "name": "ข้าวมันไก่",
        "price": 45,
        "id": 1407018
    },
    {
        "name": "ผัดซีอิ๊ว",
        "price": 55,
        "id": 1586753
    },
    {
        "name": "หมูสะเต๊ะ",
        "price": 35,
        "id": 1372995
    },
    {
        "name": "ก๋วยเตี๋ยวเรือ",
        "price": 40,
        "id": 1741773
    },
    {
        "name": "ข้าวหมูแดง",
        "price": 50,
        "id": 1485024
    },
    {
        "name": "แกงเขียวหวานไก่",
        "price": 70,
        "id": 3446324
    },
    {
        "name": "ไข่เจียว",
        "price": 25,
        "id": 1361098
    },
    {
        "name": "ก๋วยจั๊บ",
        "price": 45,
        "id": 1879055
    },
    {
        "name": "ข้าวต้ม",
        "price": 30,
        "id": 1601455
    },
    {
        "name": "แกงมัสมั่นหมู",
        "price": 65,
        "id": 1749811
    },
    {
        "name": "ปลาทอดกระเทียม",
        "price": 75,
        "id": 8162257
    },
    {
        "name": "ขนมจีนนำยา",
        "price": 50,
        "id": 5707388
    },
    {
        "name": "ผัดผักบุ้งไฟแดง",
        "price": 45,
        "id": 1634298
    },
    {
        "name": "ลาบหมู",
        "price": 60,
        "id": 6722376
    },
    {
        "name": "สปาเก็ตตี้พริกสด",
        "price": 70,
        "id": 1722728
    },
    {
        "name": "ข้าวไก่ทอด",
        "price": 55,
        "id": 8084716
    },
    {
        "name": "ไก่ป่า",
        "price": 75,
        "id": 1847755
    },
    {
        "name": "หมูผัดน้ำพริกเผา",
        "price": 60,
        "id": 1765013
    },
    {
        "name": "ข้าวเหนียวหมูย่าง",
        "price": 40,
        "id": 6279737
    },
    {
        "name": "แกงเผ็ดหมู",
        "price": 65,
        "id": 8189093
    },
    {
        "name": "ผัดพริกแกงหมูกรอบ",
        "price": 55,
        "id": 1532025
    },
    {
        "name": "ก๋วยเตี๋ยวต้มยำกุง",
        "price": 70,
        "id": 1627753
    },
    {
        "name": "ข้าวผัดปู",
        "price": 80,
        "id": 1684313
    },
    {
        "name": "ผัดเห็ดรวมหมู",
        "price": 60,
        "id": 1236281
    },
    {
        "name": "ปลากะพงทอดน้ำปลา",
        "price": 75,
        "id": 1022275
    },
    {
        "name": "ยำกุนเชียง",
        "price": 40,
        "id": 5189711
    },
    {
        "name": "ข้าวหน้าเป็ด",
        "price": 50,
        "id": 1821821
    },
    {
        "name": "ส้มตำไก่ย่าง",
        "price": 65,
        "id": 1107083
    },
    {
        "name": "ไก่ทอด",
        "price": 35,
        "id": 5389358
    },
    {
        "name": "แกงกะหรี่",
        "price": 45,
        "id": 1534751
    },
    {
        "name": "ข้าวหมูทอดกระเทียม",
        "price": 50,
        "id": 1862287
    },
    {
        "name": "แกงมัสมั่นไก่",
        "price": 70,
        "id": 1541738
    },
    {
        "name": "หอยนางรมทอด",
        "price": 60,
        "id": 6221378
    },
    {
        "name": "น้ำพริกปลาทู",
        "price": 25,
        "id": 1127878
    },
    {
        "name": "ไข่เจียวมะระ",
        "price": 45,
        "id": 1672715
    },
    {
        "name": "ผัดกระเพราหมูกรอบ",
        "price": 65,
        "id": 1471016
    },
    {
        "name": "บะหมี่เส้นใหญ่",
        "price": 40,
        "id": 1765257
    },
    {
        "name": "ข้าวขาหมู",
        "price": 55,
        "id": 3162015
    },
    {
        "name": "แกงเขียวหวานหมูสับ",
        "price": 70,
        "id": 1742756
    },
    {
        "name": "ปลาเป้า",
        "price": 75,
        "id": 8101874
    },
    {
        "name": "ยำสาหร่าย",
        "price": 60,
        "id": 1542918
    },
    {
        "name": "ข้าวผัดกระเพราไก่",
        "price": 45,
        "id": 1747754
    },
    {
        "name": "ผัดผักบุ้งไข่เจียว",
        "price": 50,
        "id": 1674011
    },
    {
        "name": "ก๋วยเตี๋ยวเส้นใหญ่น้ำตก",
        "price": 40,
        "id": 1782385
    },
    {
        "name": "ข้าวคลุกกะปิหมูกรอบ",
        "price": 55,
        "id": 8425826
    },
    {
        "name": "แกงคั่วหมู",
        "price": 60,
        "id": 1049451
    },
    {
        "name": "สปาเก็ตตี้ครีมซอสมะเขือเทศ",
        "price": 70,
        "id": 1677073
    },
    {
        "name": "ปลากระพงนึ่งมะนาว",
        "price": 75,
        "id": 1475084
    },
    {
        "name": "สลัดผักมะเขือเทศและเนยสด",
        "price": 65,
        "id": 1021324
    },
    {
        "name": "ข้าวต้มกุ้ง",
        "price": 70,
        "id": 1502955
    },
    {
        "name": "ไก่ย่าง",
        "price": 35,
        "id": 5766077
    },
    {
        "name": "ตำถั่วพลู",
        "price": 40,
        "id": 1742418
    },
    {
        "name": "ผัดซี่โครงหมูใบชะพลู",
        "price": 55,
        "id": 1224058
    },
    {
        "name": "กะหล่ำปลีผัดน้ำมันหอย",
        "price": 45,
        "id": 1434734
    },
    {
        "name": "ข้าวมันไก่หมู",
        "price": 55,
        "id": 1789075
    },
    {
        "name": "แกงส้มชะอมหมู",
        "price": 60,
        "id": 5742477
    },
    {
        "name": "ปลาเผา",
        "price": 70,
        "id": 1372885
    },
    {
        "name": "ยำไข่ดาว",
        "price": 45,
        "id": 6281754
    },
    {
        "name": "ก๋วยเตี๋ยวเส้นเล็กต้มยำ",
        "price": 50,
        "id": 8222815
    },
    {
        "name": "ข้าวหน้าเนื้อตุ๋น",
        "price": 65,
        "id": 1124897
    },
    {
        "name": "สเต็กเนื้อ",
        "price": 75,
        "id": 1324317
    },
    {
        "name": "หอยนางรมนึ่งมะนาว",
        "price": 60,
        "id": 1307985
    },
    {
        "name": "ผัดคะน้าหมูกรอบ",
        "price": 55,
        "id": 1604317
    },
    {
        "name": "ลาบเป็ด",
        "price": 60,
        "id": 5622014
    },
    {
        "name": "แกงส้มปลากระป๋อง",
        "price": 65,
        "id": 8472377
    },
    {
        "name": "ข้าวผัดอเมริกัน",
        "price": 70,
        "id": 1609731
    },
    {
        "name": "ไก่นุ่มทอดกรอบ",
        "price": 50,
        "id": 5049287
    },
    {
        "name": "ผัดกระเพราไก่ใส่ไข่ดาว",
        "price": 55,
        "id": 5485726
    },
    {
        "name": "ก๋วยเตี๋ยวเส้นใหญ่น้ำตกหมู",
        "price": 65,
        "id": 1022327
    },
    {
        "name": "ข้าวคลุกกะปิกุ้งสด",
        "price": 75,
        "id": 5026271
    },
    {
        "name": "แกงเขียวหวานปลาหมึก",
        "price": 70,
        "id": 1481814
    },
    {
        "name": "ปลาทูต้มราดข้าว",
        "price": 80,
        "id": 8762935
    },
    {
        "name": "ยำกุ้งสด",
        "price": 70,
        "id": 1582476
    },
    {
        "name": "สปาเก็ตตี้บะหมี่",
        "price": 60,
        "id": 1804798
    },
    {
        "name": "กุ้งแช่น้ำปลา",
        "price": 75,
        "id": 3679795
    },
    {
        "name": "ข้าวราดหน้าเนื้อ",
        "price": 65,
        "id": 3482098
    },
    {
        "name": "ผัดถั่วงอกหมูกรอบ",
        "price": 55,
        "id": 1042276
    },
    {
        "name": "หอยนางรมผัดฉ่า",
        "price": 60,
        "id": 1072286
    },
    {
        "name": "แกงมัสมั่นเนื้อ",
        "price": 70,
        "id": 1701315
    },
    {
        "name": "ปลานึ่งมะนาว",
        "price": 75,
        "id": 8141351
    },
    {
        "name": "ไข่เจียวน้ำเต้าหู้",
        "price": 55,
        "id": 1446754
    },
    {
        "name": "ผัดกระเพรากุ้ง",
        "price": 70,
        "id": 6627035
    },
    {
        "name": "ก๋วยเตี๋ยวเส้นใหญ่น้ำตกไก่",
        "price": 60,
        "id": 1324053
    },
    {
        "name": "ข้าวคลุกกะปิหมึก",
        "price": 65,
        "id": 1135297
    },
    {
        "name": "แกงส้มหมูต้ม",
        "price": 70,
        "id": 1004218
    },
    {
        "name": "สเต็กปลาหมึก",
        "price": 75,
        "id": 1721717
    },
    {
        "name": "หมูย่าง",
        "price": 80,
        "id": 1824087
    },
    {
        "name": "ผัดถั่วงอกกุ้ง",
        "price": 70,
        "id": 1841894
    },
    {
        "name": "ลาบปลาทู",
        "price": 75,
        "id": 5002216
    },
    {
        "name": "ข้าวราดหน้าหมู",
        "price": 70,
        "id": 8702217
    },
    {
        "name": "แกงเขียวหวานเต้าหู้หมู",
        "price": 75,
        "id": 5202277
    },
    {
        "name": "ปลากระพงทอดกระเทียมพริกไทย",
        "price": 80,
        "id": 1004497
    },
    {
        "name": "ยำมะม่วง",
        "price": 70,
        "id": 1084237
    },
    {
        "name": "สปาเก็ตตี้กุ้ง",
        "price": 75,
        "id": 6442074
    },
    {
        "name": "ก๋วยเตี๋ยวเส้นใหญ่น้ำตกทะเล",
        "price": 80,
        "id": 1722978
    }
]
